{"TOMMY HILFIGER LADIES WATCH - ROSE": {"cateogry": ["Home", "Watches", "TOMMY HILFIGER", "TOMMY HILFIGER LADIES WATCH - ROSE"], "description": "A striking stainless steel bangle bracelet pairs beautifully with glistening crystals in this sophisticated sport watch. Featuring a 28mm stainless steel case and silver-tone dial with crystals markers and Tommy Hilfiger logo.28 mm", "price": "$199.00", "miles": "24,875 miles", "image_source": "https://dxcgf0a4ch4xd.cloudfront.net/prod/148997_FICF4I4g7.jpg"}, "TRESSE DINLIDA BOOKFOLD PURSE - WAVE": {"cateogry": ["Home", "Luggage, Bags & Wallets", "TRESSE", "TRESSE DINLIDA BOOKFOLD PURSE - WAVE"], "description": "Fitting comfortably into most handbags, the multi-tone weave of the Dinlida communicates a sense of individuality. Quintessentially chic without the unnecessary bulk, this purse is the perfect alternative for running errands about the city. Crafted in durable leather, the Dinlida boasts practicality without losing its aesthetic edge.Dimensions (H x W x D): 9.5 x 18 x 2 cm", "price": "$191.00", "miles": "23,875 miles", "image_source": "https://dxcgf0a4ch4xd.cloudfront.net/prod/168239_2BGPFAAFe.jpg"}, "LOQI URBAN MEDIUM LUGGAGE COVER - MOSCOW (23\" - 26\")": {"cateogry": ["Home", "Travel & Gifts", "LOQI", "LOQI URBAN MEDIUM LUGGAGE COVER - MOSCOW (23\" - 26\")"], "description": "Bring bliss to the baggage claim. Get giggles at the gate. You'll earn miles and miles of smiles with a LOQI luggage cover. Sometimes what’s on the outside counts too. I am available in 3 different sizes. Small: 19\" - 22\"Medium: 23” - 26\"Large: 27\" - 30\"Product information:• 85% Polyester, 15% Spandex• 310 GSM material strength• Water-resistant and washable• Dimensions: 50 x 1 x 61 cm• Weight: 0.17kg", "price": "$36.00", "miles": "4,500 miles", "image_source": "https://dxcgf0a4ch4xd.cloudfront.net/prod/169280_5veWE92pM.jpg"}, "APPLE IPHONE 8 64GB (PRODUCT)RED SPECIAL EDITION": {"cateogry": ["Home", "Electronics", "APPLE", "APPLE IPHONE 8 64GB (PRODUCT)RED SPECIAL EDITION"], "description": "iPhone 8 is a new generation of iPhone. Designed with the most durable glass ever in a smartphone and a stronger, aerospace-grade aluminium band. Charges wirelessly.1 Resists water and dust.2 4.7-inch Retina HD display with True Tone.3 12-megapixel camera with new sensor and advanced image signal processor. Powered by A11 Bionic, the most powerful and smartest chip ever in a smartphone. Supports augmented reality experiences in games and apps. With iPhone 8, intelligence has never looked better.•\t4.7-inch Retina HD display with True Tone3•\tAll-glass and aluminium design, water and dust resistant2•\t12MP camera with OIS and 4K video up to 60 fps•\t7MP FaceTime HD camera with Retina Flash for stunning selfies4•\tTouch ID for secure authentication and Apple Pay•\tA11 Bionic, the most powerful and smartest chip in a smartphone•\tWireless charging — works with Qi chargers1Charging mat is sold separately.2iPhone 8 and iPhone 8 Plus are splash, water and dust resistant, and were tested under controlled laboratory conditions with a rating of IP67 under IEC standard 60529. Splash, water and dust resistance are not permanent conditions and resistance might decrease as a result of normal wear. Do not attempt to charge a wet iPhone; refer to the user guide for cleaning and drying instructions. Liquid damage is not covered under warranty.3Display size is measured diagonally.4FaceTime calling requires a FaceTime-enabled device for the caller and recipient, and a Wi-Fi connection. Availability over a mobile network depends on carrier policies; data charges may apply.Only available for partial miles redemption at minimum 25% of the retail price.", "price": "$1,072.90", "miles": "134,112 miles", "image_source": "https://dxcgf0a4ch4xd.cloudfront.net/prod/201252_npd0kJAVe.png"}}